openbsd-vnc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-28 Fri 18:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>setting up vnc with xenodm on openbsd</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">setting up vnc with xenodm on openbsd</h1>
<p>
adapted from <a href="https://www.tumfatig.net/2011/vnc-server-on-openbsd/">this guide</a>, but modified to use xenodm
</p>

<div class="fixme" id="org0000000">
<p>
currently does not work without a virtual video output
</p>

</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> install x11vnc</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">pkg_add -U x11vnc
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> enable and start xenodm</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">rcctl enable xenodm
rcctl start xenodm
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000004" class="outline-2">
<h2 id="org0000004"><span class="section-number-2">3.</span> configure x11vnc</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">3.1.</span> create file for password hash</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">x11vnc -storepasswd /etc/x11vnc.passwd
</pre>
</div>
</div>
</div>
<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">3.2.</span> rc.d</h3>
<div class="outline-text-3" id="text-3-2">
<p>
in <code>/etc/rc.conf.local</code> add
</p>
<pre class="example" id="org0000003">
x11vnc_flags="-rfbauth /etc/x11vnc.passwd -logfile /var/log/x11vnc -ncache 0 -forever -loop100 -auth guess"
</pre>

<p>
add a <code>-listen</code> and <code>-listen6</code> to the flags to restrict listening to a
specific interface.
</p>

<p>
add <code>-ssl SAVE_NOPROMPT</code> to automatically make a self-signed ssl certificate
and reuse it, or replace SAVE_NOPROMPT with the path to your pem file to use a
ca-signed one.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000007" class="outline-2">
<h2 id="org0000007"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> x11 dummy display</h2>
<div class="outline-text-2" id="text-4">
<p>
skip this part if you already have a display
</p>

<p>
this section borrows a lot of the Xorg configuration from Xpra.
</p>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">4.1.</span> modeline</h3>
<div class="outline-text-3" id="text-4-1">
<p>
use <code>cvt</code> to make a modeline string
</p>

<p>
for example to create a modeline for a <code>1366x768</code> resolution and <code>30</code>
hz, do
</p>
<pre class="example" id="org0000005">
cvt 1366 768 30
</pre>
</div>
</div>


<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">4.2.</span> xorg conf</h3>
<div class="outline-text-3" id="text-4-2">
<p>
create the <code>/etc/X11/xorg.conf.d/</code> directory if it does not already
exist, and create a file called <code>10-dummy.conf</code> with
</p>
<pre class="example" id="org0000006">
Section "Monitor"
  Identifier "dummy_monitor"
  HorizSync 28.0-80.0 # i have no idea what this means
  VertRefresh 48.0-75.0
  # 1366x768 29.89 Hz (CVT) hsync: 23.44 kHz; pclk: 39.75 MHz
  Modeline "1360x768_30.00"   39.75  1366 1399 1527 1696  768 771 781 784 -hsync +vsync
EndSection

Section "Device"
  Identifier "dummy_videocard"
  Driver "dummy"
  Option "ConstantDPI" "true"
  VideoRam 196000
EndSection

Section "Screen"
  DefaultDepth 24
  Identifier "dummy_screen"
  Device "dummy_videocard"
  Monitor "dummy_monitor"
  SubSection "Display"
    Depth 24
    Modes "1360x768_30.00"
  EndSubSection
EndSection

#Section "ServerFlags"
#  Option "DontVTSwitch" "true"
#  Option "AllowMouseOpenFail" "true"
#  Option "PciForceNone" "true"
#  Option "AutoEnableDevices" "false"
#  Option "AutoAddDevices" "false"
#EndSection

Section "InputDevice"
  Identifier "dummy_mouse"
  Option "CorePointer" "true"
  Driver "void"
EndSection

Section "InputDevice"
  Identifier "dummy_keyboard"
  Option "CoreKeyboard" "true"
  Driver "void"
EndSection
</pre>

<p>
replace the modeline with the one you generated in the previous step
if nessesary.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000008" class="outline-2">
<h2 id="org0000008"><span class="section-number-2">5.</span> enable and start x11vnc</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh">rcctl enable x11vnc
rcctl start x11vnc
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
